epyc/20240114-0531/4-lock-partitions/32768/pgbench-warmup-100-100.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 100
partition method: range
partitions: 100
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 52890672
number of failed transactions: 0 (0.000%)
latency average = 0.036 ms
initial connection time = 11.216 ms
tps = 881668.989360 (without initial connection time)